

insert into course
(c_place , c_add , c_x,c_y, c_city)
values
('군산근대역사박물관','전북 군산시 해망로 240',35.990797,126.712406,'군산'),
('이성당','전라북도 군산시 중앙로 177 이성당',35.987146,126.711273,'군산'),
('철길마을','전라북도 군산시 경촌4길 14',35.981245,126.736312,'군산')




insert into course
(c_place , c_add , c_x,c_y, c_city)
values
('내장산','전북 정읍시 내장산로 1207',35.487843,126.907490,'정읍'),
('우화정','전라북도 정읍시 내장동 산231',35.486509,126.916503,'정읍')

insert into course
(c_place , c_add , c_x,c_y, c_city)
values
('아원고택','전라북도 완주군 소양면 대흥리 송광수만로 516-7',35.90447,127.244566,'완주')